SET NAMES UTF8;
DROP DATABASE IF EXISTS flowers;
CREATE DATABASE flowers CHARSET=UTF8;
USE flowers;
CREATE TABLE classify(
  lid INT,
  image VARCHAR(64),
  title VARCHAR(64),
  category INT 
);
INSERT INTO classify VALUES('1','tb3_2.png','七夕鲜花','10');
INSERT INTO classify VALUES('2','tb1.png','爱情鲜花','10');
INSERT INTO classify VALUES('3','tb2.png','生日鲜花','10');
INSERT INTO classify VALUES('4','tb4.png','全部鲜花','10');
INSERT INTO classify VALUES('5','tb5.png','开业花篮','10');
INSERT INTO classify VALUES('6','tb6.png','精品蛋糕','10');
INSERT INTO classify VALUES('7','tb7.png','礼品','10');
INSERT INTO classify VALUES('8','tb8.png','全部分类','10');


CREATE TABLE products(
	lid INT,
	image VARCHAR(64),
	smalltitle VARCHAR(64),
	title VARCHAR(64),
	price DECIMAL(7,2),
	sales INT,
	onsale DECIMAL(7,2),
	category INT,
	fit VARCHAR(32),
	purpose VARCHAR(32),
	allimage VARCHAR(320)
);

INSERT INTO products VALUES(1,'1_06501321564471271_320.jpg','七夕粉玫瑰送爱人','七夕恋爱粉玫瑰送爱人 - 11枝戴安娜玫瑰，搭配尤加利、白色羽毛',208.00,26688,58.00,20,'恋人','惊喜生日 , 商务庆贺 , 结婚纪念 , 问候长辈','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(2,'1_06501279157695565_320.jpg','七夕告白红玫瑰','七夕告白红玫瑰 - 11枝卡罗拉红玫瑰搭配白色满天星',219.00,30463,347.00,20,'恋人 , 闺蜜 , 老婆','浪漫爱情 , 惊喜生日 , 求婚表白 , 结婚纪念','qy_wap.jpg|1_06432121877983655_640.jpg|1_06432121902641492_640.jpg|1_06443201324473740_640.jpg|1_06443201365611109_640.jpg|1_06443201421147950_640.jpg|bt_3.jpg'),
(3,'1_06501359251212061_320.jpg','99朵玫瑰情人节告白','99朵玫瑰情人节告白 - 99枝卡罗拉红玫瑰皇冠款',669.00,16958,189.00,20,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06514069148680088_640.jpg|wap6.jpg|1_06443201421147950_640.jpg|wap7.jpg|wap8.jpg|bt_3.jpg'),
(4,'1_06510876468287773_320.jpg','七夕·爱你生生世世','七夕·爱你生生世世 - 33枝卡罗拉红玫瑰搭配红色洋牡丹、红康、红色拉丝扶郎，1个love灯',409.00,15342,117.00,20,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(5,'1_06501317626591061_320.jpg','七夕相爱玫瑰礼盒','七夕相爱玫瑰礼盒 - 11朵卡罗拉红玫瑰，一对小熊，搭配相思梅、栀子叶',246.00,35563,70.00,20,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(6,'1_06501348213932762_320.jpg','七夕玫瑰送老婆','七夕玫瑰送老婆送女友 - 9枝桃红雪山玫瑰搭配白桔梗、白色多丁、尤加利叶',196.00,15540,60.00,20,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),


(7,'1_06501318904028464_320.jpg','七夕玫瑰送爱人','七夕红玫瑰送爱人 - 11枝卡罗拉红玫瑰，搭配白色满天星',219.00,30231,67.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(8,'1_06501346864076152_320.jpg','七夕宠爱玫瑰花','七夕宠爱玫瑰花 - 11枝卡罗拉红玫瑰、1枝多头粉百合搭配尤加利叶',236.00,7207,60.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(9,'1_06501327920999328_320.jpg','七夕99朵求婚粉玫瑰','七夕99朵求婚粉玫瑰 - 99朵艾莎玫瑰',599.00,6022,169.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(10,'1_06501318542341283_320.jpg','七夕33朵红玫瑰','七夕33朵红玫瑰送女友 - 33枝卡罗拉红玫瑰，搭配白色满天星',329.00,31144,149.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(11,'1_06511595897476503_320.jpg','七夕送男士首选','七夕送男士首选 - 11朵蓝色妖姬，搭配满天星',276.00,21519,72.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(12,'1_06439927969737149_320.jpg','爱你如初','爱你如初 - 19朵顶级苏醒玫瑰，搭配进口尤加利叶',329.00,12317,97.00,30,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),


(13,'1_06501331104287411_320.jpg','七夕心动红玫瑰','七夕心动红玫瑰 - 11枝卡罗拉红玫瑰搭配尤加利叶、橙色水仙百合',219.00,19076,67.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(14,'1_06506339457591178_320.jpg','七夕11枝红玫瑰','七夕11枝红玫瑰花束 - 11枝卡罗拉红玫瑰搭配尤加利叶、澳洲腊梅',236.00,12687,60.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(15,'1_06501348576181217_320.jpg','七夕33朵蓝色妖姬','七夕33朵蓝色妖姬 - 33枝蓝色妖姬搭配1个皇冠',529.00,10584,150.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(16,'1_06501318077319845_320.jpg','爱的小确幸','爱的小确幸 - 7朵白玫，2朵戴安娜，搭配情人草、满天星、栀子叶、粉色相思梅',208.00,19680,58.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(17,'1_06501353620705107_320.jpg','七夕情人节浪漫爱情','七夕情人节浪漫爱情 - 11枝卡罗拉红玫瑰搭配尤加利叶，10颗巧克力，一对小熊',308.00,9379,88.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(18,'1_06501326404462661_320.jpg','七夕33朵红玫瑰','七夕33朵红玫瑰 - 33枝卡罗拉红玫瑰',329.00,3932,167.00,40,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),


(19,'1_06501322099747023_320.jpg','9枝红玫瑰爱情花束','9枝红玫瑰爱情花束 - 9枝卡罗拉红玫瑰搭配尤加利叶',186.00,24468,50.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(20,'1_05834387156346949_320.jpg','我们的幸福',' 我们的幸福 - 11朵卡罗拉红玫瑰，一对小熊，满天星、栀子叶点缀',208.00,30742,58.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(21,'1_06501276741824411_320.jpg','七夕送女友玫瑰花','七夕送女友玫瑰花 - 9枝粉雪山玫瑰搭配蓝色满天星',219.00,17371,67.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(22,'1_06510879415777387_320.jpg','七夕米奇创意花盒','七夕米奇创意花盒 - 19枝卡罗拉红玫瑰搭配16颗费雷罗巧克力',486.00,8973,132.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(23,'1_06511592349491764_320.jpg','慢慢爱你199朵玫瑰','慢慢爱你/大束199朵玫瑰 - 199枝卡罗拉红玫瑰',1399.00,14035,397.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(24,'1_06506333133453982_320.jpg','炽热爱恋33枝红玫瑰','炽热爱恋/33枝红玫瑰礼盒 - 33枝卡罗拉红玫瑰',398.00,11372,118.00,50,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),

(25,'1_06005317857441048_320.jpg','一生眷恋','一生眷恋 - 费列罗8颗心形礼盒+33枝红玫瑰搭配尤加利叶',476.00,2380,130.00,60,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(26,'1_06222868886445644_320.jpg','超模同款·甜蜜组合','超模同款·甜蜜组合 - 德芙98g心形礼盒+11枝红玫瑰搭配满天星',318.00,524,90.00,60,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(27,'1_06382858571005933_320.jpg','初心不负-甜蜜款','初心不负-甜蜜款 - 3枝粉佳人玫瑰，6枝玛丽亚玫瑰，4朵粉百合搭配粉小菊，尤加利叶+德芙98g心形礼盒装',308.00,2448,88.00,60,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg'),
(28,'1_06249738864514945_320.jpg','超模同款·美好甜蜜','超模同款·美好甜蜜 - 99枝红玫瑰搭配尤加利叶+德芙98g心形礼盒',699.00,64,197.00,60,'恋人 , 闺蜜','浪漫爱情 , 惊喜生日 , 商务庆贺 , 结婚纪念','qy_wap.jpg|1_06179721003195392_640.jpg|1_06179721005644300_640.jpg|1_06179721005765146_640.jpg|1_06179721006801025_640.jpg|1_06179721020460282_640.jpg|bt_3.jpg');


CREATE TABLE users(
	phone VARCHAR(11),
	upwd VARCHAR(16)
);

INSERT INTO users VALUES(15800981514,'123456');

















